#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T10:56:50.303+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "C44mRFyQVFgHXaWUs1DEaI5bS/WmLukzU3aSVLay45E=" -> (known after apply)
        source_code_size               = 915
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-otg.data.archive_file.aws_lambda_otg will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_otg"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-otg/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-otg/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-otg.aws_api_gateway_deployment.aws_lambda_otg must be replaced
-/+ resource "aws_api_gateway_deployment" "aws_lambda_otg" {
      ~ created_date  = "2020-03-01T00:49:27Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:589845989135:3ek5fsxtj1/test" -> (known after apply)
      ~ id            = "bf9cpu" -> (known after apply)
      ~ invoke_url    = "https://3ek5fsxtj1.execute-api.us-east-1.amazonaws.com/test" -> (known after apply)
        rest_api_id   = "3ek5fsxtj1"
      ~ stage_name    = "test" -> "api" # forces replacement
    }

  # module.aws-lambda-otg.aws_api_gateway_integration.aws_lambda_otg must be replaced
-/+ resource "aws_api_gateway_integration" "aws_lambda_otg" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "rpuygj" -> (known after apply)
        connection_type         = "INTERNET"
      ~ http_method             = "GET" -> "POST" # forces replacement
      ~ id                      = "agi-3ek5fsxtj1-rpuygj-GET" -> (known after apply)
        integration_http_method = "POST"
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
        resource_id             = "rpuygj"
        rest_api_id             = "3ek5fsxtj1"
        timeout_milliseconds    = 29000
        type                    = "AWS_PROXY"
        uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg/invocations"
    }

  # module.aws-lambda-otg.aws_api_gateway_method.aws_lambda_otg must be replaced
-/+ resource "aws_api_gateway_method" "aws_lambda_otg" {
        api_key_required     = false
        authorization        = "NONE"
      - authorization_scopes = [] -> null
      ~ http_method          = "GET" -> "POST" # forces replacement
      ~ id                   = "agm-3ek5fsxtj1-rpuygj-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
        resource_id          = "rpuygj"
        rest_api_id          = "3ek5fsxtj1"
    }

  # module.aws-lambda-otg.aws_lambda_function.aws_lambda_otg will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_otg" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg"
        filename                       = "modules/aws-lambda-otg/lambda.zip"
        function_name                  = "aws-lambda-otg"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-otg"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg/invocations"
      ~ last_modified                  = "2020-03-01T00:49:27.923+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-otg:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-otg"
        runtime                        = "python3.7"
      ~ source_code_hash               = "N2eE1XmR1oOZdm99AkkPujIzDqy7pBTcjkcH81/aGis=" -> (known after apply)
        source_code_size               = 583
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "LINE_NOTIFY_TOKEN" = "E5wMLhCmVvsmaYqf8AVezO1O5pySN8cG6LbbaYOUdi8"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-otg.aws_lambda_permission.aws_lambda_otg must be replaced
-/+ resource "aws_lambda_permission" "aws_lambda_otg" {
        action        = "lambda:InvokeFunction"
        function_name = "aws-lambda-otg"
      ~ id            = "AllowExecutionFromAPIGateway" -> (known after apply)
        principal     = "apigateway.amazonaws.com"
      ~ source_arn    = "arn:aws:execute-api:us-east-1:589845989135:3ek5fsxtj1/test/*/*" -> (known after apply) # forces replacement
        statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
